In [2]:
# 数据清洗包含了缺失值、重复值、字符串操作等等内容 是数据预处理中重要的一部分
import pandas as pd
import numpy as np
from numpy import nan as NULL
from numpy import nan as NA
from pandas import DataFrame, Series

In [31]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [32]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [12]:
string_data.notna()

0    False
1     True
2    False
3     True
dtype: bool

In [24]:
string_data.fillna?

In [17]:
df = DataFrame([1,2]).reindex?

Object `reindex` not found.

In [21]:
df = DataFrame(np.arange(10))

In [23]:
df.reindex?

In [36]:
string_data.fillna(method='ffill')

0     aardvark
1    artichoke
2    artichoke
3      avocado
dtype: object

In [33]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [38]:
data.dropna() # remove缺失值

0    1.0
2    3.5
4    7.0
dtype: float64

In [43]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]], columns=list('abc'))

In [44]:
data

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [49]:
cleaned = data.dropna(how='all') # 当所有值都是NA才删除

In [50]:
cleaned

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [51]:
data['a'][1] = NA

In [58]:
data.dropna?

In [59]:
data[4] = NA

In [60]:
data

     a    b    c   4
0  1.0  6.5  3.0 NaN
1  NaN  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [62]:
data.dropna(axis=1, how='all')

     a    b    c
0  1.0  6.5  3.0
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [64]:
data.drop?

In [65]:
data.drop(0)

    a    b    c   4
1 NaN  NaN  NaN NaN
2 NaN  NaN  NaN NaN
3 NaN  6.5  3.0 NaN

In [103]:
df = pd.DataFrame(np.random.randn(7, 3))

In [104]:
df.iloc[:4, 1] = NA

In [105]:
df.iloc[:2, 2] = NA

In [106]:
df

          0         1         2
0  1.475162       NaN       NaN
1  1.094550       NaN       NaN
2 -0.542647       NaN  1.558080
3  2.064381       NaN  1.260885
4 -0.879697  0.987806  0.313529
5  0.121124 -0.021943 -0.268673
6  0.791605  0.749020 -1.565092

In [107]:
df.dropna()

          0         1         2
4 -0.879697  0.987806  0.313529
5  0.121124 -0.021943 -0.268673
6  0.791605  0.749020 -1.565092

In [108]:
df.dropna(axis=1)

          0
0  1.475162
1  1.094550
2 -0.542647
3  2.064381
4 -0.879697
5  0.121124
6  0.791605

In [121]:
df.dropna(thresh=2, inplace=False)

          0         1         2
2 -0.542647       NaN  1.558080
3  2.064381       NaN  1.260885
4 -0.879697  0.987806  0.313529
5  0.121124 -0.021943 -0.268673
6  0.791605  0.749020 -1.565092

In [116]:
df

          0         1         2
0  1.475162       NaN       NaN
1  1.094550       NaN       NaN
2 -0.542647       NaN  1.558080
3  2.064381       NaN  1.260885
4 -0.879697  0.987806  0.313529
5  0.121124 -0.021943 -0.268673
6  0.791605  0.749020 -1.565092

In [122]:
df

          0         1         2
0  1.475162       NaN       NaN
1  1.094550       NaN       NaN
2 -0.542647       NaN  1.558080
3  2.064381       NaN  1.260885
4 -0.879697  0.987806  0.313529
5  0.121124 -0.021943 -0.268673
6  0.791605  0.749020 -1.565092

In [123]:
df.fillna({1: 0.5, 2: 0}) # 使用字典分别指定不同列的处理方法

          0         1         2
0  1.475162  0.500000  0.000000
1  1.094550  0.500000  0.000000
2 -0.542647  0.500000  1.558080
3  2.064381  0.500000  1.260885
4 -0.879697  0.987806  0.313529
5  0.121124 -0.021943 -0.268673
6  0.791605  0.749020 -1.565092

In [128]:
df.fillna(limit=2, method='bfill', inplace=True)

In [129]:
df.fillna(limit=2, method='ffill', inplace=True)

In [130]:
df

          0         1         2
0  1.475162  0.987806  1.558080
1  1.094550  0.987806  1.558080
2 -0.542647  0.987806  1.558080
3  2.064381  0.987806  1.260885
4 -0.879697  0.987806  0.313529
5  0.121124 -0.021943 -0.268673
6  0.791605  0.749020 -1.565092

In [135]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [136]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [139]:
data.fillna(data.mean()) # 使用平均值进行填充

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [140]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [4]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [5]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [6]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [7]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [9]:
data['k3'] = range(7)

In [10]:
data

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [18]:
data.drop_duplicates(['k1', 'k2'], keep=False)

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4

In [21]:
data['k1'].str.title() # 创建字符串 然后使用字符串的内置函数对其进行操作

0    One
1    Two
2    One
3    Two
4    One
5    Two
6    Two
Name: k1, dtype: object

In [24]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [25]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [37]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [38]:
lowercased = data['food'].str.lower()

In [39]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [40]:
data['animal'] = lowercased.map(meat_to_animal) # 使用map方法 获取键值对的映射

In [41]:
data.drop('animal', axis=1)

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
data['animal'] = lowercased.map(lambda x: meat_to_animal[x.lower()]) # 定义lambda函数 处理键值对的映射

In [43]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [45]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace(-999, NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace([1000, -999], NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace([-1000, -999], [0, NA])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
data.replace({-1000: 0, -999: NA})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [52]:
data.replace?

In [53]:
data.replace(None, method='ffill')

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [54]:
str1 = 'hello world'
str1.replace('hel', 'fuck')

'fucklo world'

In [55]:
str1

'hello world'

In [56]:
str.replace?

In [77]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [79]:
transform = lambda x: x[:4].upper()

In [80]:
transform

In [81]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [82]:
data.index = data.index.map(transform)

In [83]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [84]:
data.index = data.index.str.title()

In [85]:
data

      one  two  three  four
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [86]:
data.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [87]:
data.columns = data.columns.str.upper()

In [88]:
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [72]:
data.rename?

In [76]:
# data.rename(index=str.title, columns=str.upper) # ?
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [91]:
data.rename(index={'Ohio': "INDIANA"},
           columns={'THREEE': 'peekaboo'}, inplace=True)

In [92]:
data

         ONE  TWO  THREE  FOUR
INDIANA    0    1      2     3
Colo       4    5      6     7
New        8    9     10    11

In [93]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [94]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [95]:
bins = [18, 25, 35, 60, 100]

In [98]:
cats = pd.cut(ages, bins, right=True)

In [99]:
cats

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [100]:
cats.codes # 获取值所属的箱位

array([0, 0, 1, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [103]:
cats.categories

IntervalIndex([[18, 25), [25, 35), [35, 60), [60, 100)], dtype='interval[int64, left]')

In [104]:
pd.value_counts(cats) # 箱也可以算作是一种数据值

[18, 25)     4
[25, 35)     4
[35, 60)     3
[60, 100)    1
dtype: int64

In [105]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [106]:
pd.cut(ages, bins, right=True, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [107]:
data = np.random.randn(20)

In [109]:
pd.cut(data, 4, precision=2)

[(0.29, 0.87], (-0.87, -0.29], (-0.87, -0.29], (-0.87, -0.29], (0.29, 0.87], ..., (0.29, 0.87], (-1.46, -0.87], (-0.87, -0.29], (-0.29, 0.29], (0.29, 0.87]]
Length: 20
Categories (4, interval[float64, right]): [(-1.46, -0.87] < (-0.87, -0.29] < (-0.29, 0.29] < (0.29, 0.87]]

In [110]:
data = np.random.randn(1000) # 正态分布

In [111]:
data

array([-1.70331048e-01, -7.99944344e-01, -7.92718631e-02, -9.08610136e-01,
        1.18569230e+00,  2.49554892e-01, -1.14139371e-01, -3.30358733e-01,
        7.44762453e-01, -3.48131014e-01,  9.30357413e-01, -2.32277097e-01,
       -5.76403693e-01,  4.09336876e-01, -3.82548148e-01, -1.04147068e+00,
        2.20966113e-01, -1.49256063e+00,  8.82345455e-01,  3.02970411e-02,
       -3.64861640e-01, -3.10135523e-01, -1.78301799e+00, -3.86984948e-01,
       -1.72892897e-01,  2.70159145e-01, -5.24484166e-01,  1.20860066e-01,
        1.53487619e+00,  5.71167203e-01,  7.28805415e-01,  6.58608374e-02,
        7.40555305e-01,  2.17546645e-01,  4.83657493e-02, -8.40977028e-01,
       -6.36970811e-01,  2.08329103e+00,  1.59972248e+00,  9.49040087e-01,
        8.50275759e-01,  3.65392266e-01,  4.71495826e-01, -1.01712978e+00,
        1.98834512e-02,  6.31585415e-01,  3.99563678e-01, -2.86712895e-01,
        3.15684664e-01, -2.06124619e-01, -3.45285800e-01, -5.72439596e-01,
       -7.48760395e-01,  2.31947090e-01,  8.43910378e-02, -4.98241184e-01,
       -5.96859359e-01, -5.61065356e-01,  1.18438754e+00, -7.44898108e-01,
       -3.77227278e-01,  3.43378890e-01,  8.59345797e-02, -6.77807804e-01,
       -9.46119720e-01, -1.25913159e+00,  4.71049754e-01,  8.98368347e-02,
        7.41753010e-01, -1.36949224e+00,  1.71189575e-01, -6.56249372e-01,
        7.08159562e-02,  7.83545492e-03, -1.47642339e+00, -8.37270610e-01,
       -2.09895772e-01, -5.15528090e-01, -1.41401193e+00,  1.65252786e+00,
        2.73266468e-01, -1.01276999e+00,  2.92848567e-03,  6.96518582e-01,
        3.90743680e-02,  4.62017176e-02, -2.10595338e-01,  4.07512061e-01,
       -6.69589175e-01,  2.37881376e-01,  5.52122294e-01,  9.80823235e-02,
        1.44156741e+00,  4.11592037e-02, -5.36356939e-01, -2.38222518e-02,
       -1.34498484e-01,  1.45147873e+00,  2.77669546e-01,  5.82464708e-01,
        1.77406749e-01, -1.24499480e-01,  6.81196746e-01,  5.41117061e-01,
        1.07047153e-01,  5.95431750e-01,  3.22136345e-01, -1.22139235e-01,
       -1.01724776e+00,  8.24620870e-01,  4.36089740e-01, -6.92976576e-01,
       -6.19520422e-02,  3.93001390e-01,  2.93893900e-01, -8.01211529e-01,
        1.84326111e-02, -1.17527931e+00,  3.85934586e-01,  1.10206556e+00,
       -3.44671461e-01,  2.04442058e+00,  4.19084785e-01,  1.22018706e+00,
        2.10102035e+00, -5.24614474e-01, -1.60084620e+00, -9.97825745e-01,
        9.07461595e-02,  1.92559038e+00, -1.92095499e-01,  1.00828316e+00,
       -1.74997299e-01,  7.34554098e-01, -1.61693266e+00, -1.59379032e+00,
        1.77764355e-01,  1.25122063e-01, -1.15249271e+00, -1.31386301e+00,
       -1.13570708e+00, -1.35139494e+00, -7.43969035e-01, -3.85735559e-01,
       -3.86709669e-01,  1.53610259e+00, -1.72274817e+00,  7.75109587e-01,
        9.28642154e-02,  1.69111653e-01,  7.14654538e-01, -1.62622399e+00,
        3.93551470e-01, -1.03413820e+00,  1.36571561e+00,  1.13496395e+00,
       -4.16146850e-01, -7.65259275e-01, -7.01476623e-01, -2.93825293e-01,
       -2.72877106e-02, -1.43548632e+00, -4.54219047e-01, -1.20542352e+00,
       -3.41907884e-01, -1.85303969e+00, -2.95298845e-01,  5.64664490e-02,
        1.13740388e-01, -2.06474898e-01, -5.61893276e-01, -2.12349632e+00,
       -1.10411496e+00,  2.86081047e-01, -1.80793210e+00, -2.80256878e-01,
        7.53855549e-01, -2.56719082e-01, -7.58382090e-02,  9.91436454e-03,
       -6.11758349e-01,  4.17006493e-01, -9.70713066e-02, -1.01575813e+00,
       -5.63964115e-01,  1.95617969e-01, -2.53912343e-01,  7.58816477e-01,
        7.87030866e-01,  1.84760734e-01,  1.39515327e+00, -3.23454264e-01,
       -2.27896920e-01, -4.39346213e-01,  1.67027116e-01, -3.27343591e-01,
        1.90122920e+00, -7.39481344e-01, -3.34678685e-01,  8.72725089e-01,
        4.39782410e-01, -7.51152947e-01,  1.16259593e+00,  1.14903682e+00,
        8.07263215e-01,  3.68621231e-01, -4.88562930e-01,  3.49162654e-01,
       -8.79435023e-01,  2.24992652e+00,  1.76742785e-01, -5.99826159e-01,
        1.07948489e+00, -2.18307105e+00,  2.43297124e+00,  3.05423918e-01,
        2.28813351e-02, -7.47912247e-01, -9.48957854e-01, -2.31992662e-01,
       -1.81597738e-02,  9.73243091e-01, -1.50549427e+00, -7.52620002e-01,
       -1.86998731e+00, -7.07363412e-01,  3.08531021e-01,  1.24087618e+00,
        8.91707142e-02,  3.41874945e-01, -1.21340796e+00, -5.73151049e-01,
       -9.24948710e-01, -6.12466004e-01, -2.13879788e-01, -1.28970026e+00,
       -8.67270192e-01,  1.04617774e+00,  1.51195219e+00,  7.64539164e-01,
        1.56377820e+00,  1.25044765e+00, -9.39508801e-01, -1.55985912e-01,
        3.27950325e-01, -5.97075596e-01,  5.65818331e-01, -2.69739228e+00,
        5.77849565e-01,  8.62495852e-01, -1.26503919e+00, -8.20373714e-02,
       -1.65986844e+00,  2.94816351e-01, -9.19601491e-01,  9.53027621e-01,
       -3.82608400e-01, -8.33171301e-01,  1.10382406e+00, -2.56266387e-01,
        2.87922198e-01, -1.77916039e+00, -7.79113660e-02,  4.10849820e-01,
       -2.63965068e+00, -9.26669758e-02, -5.06646328e-01, -6.07273938e-01,
        1.60234582e+00, -1.61142825e+00,  7.61120657e-01,  7.67652246e-01,
        3.26144860e+00, -3.40365802e-01,  1.43140320e+00,  3.97207475e-02,
        1.69532404e+00,  6.21837937e-01,  4.82648327e-01,  8.10250195e-02,
        1.82861419e-01, -2.50341097e+00, -7.08679111e-01,  3.32310407e-01,
        7.35842391e-01, -7.07261083e-01,  1.30498776e-01,  1.04067620e+00,
       -5.42819379e-01, -6.72273163e-01, -4.70894958e-01,  1.43454960e+00,
        2.28821557e-01,  1.51872340e+00,  4.07921297e-01,  8.46989096e-02,
        3.82032114e-01,  3.06175325e-01, -5.26946765e-01, -8.79119217e-01,
       -1.63163147e+00,  7.98275423e-01, -6.11435358e-01, -3.04930832e-01,
       -1.06616438e+00, -2.15965043e+00,  6.06943978e-01, -2.98614307e-01,
       -2.43007181e+00, -1.04881841e-01,  1.88142635e+00,  2.07446232e-01,
        2.14354628e-01, -8.90631540e-02,  1.63580618e+00,  3.08452009e-01,
        2.13596417e-01,  3.18528124e-04, -2.81157980e-01, -6.34685581e-01,
       -1.92259523e+00, -1.61541087e+00,  2.34256868e+00,  1.93551096e-01,
        7.19437398e-01,  1.75951160e+00,  5.42904810e-01,  3.53250627e-01,
       -3.91929039e-01, -7.72125842e-01, -3.95079787e-01, -2.03501872e-01,
       -5.11780319e-01,  1.65591929e+00, -1.34700129e-01, -2.28671487e-01,
        1.09116352e+00,  1.38901647e+00, -9.42197078e-01, -6.16804625e-02,
        1.32021291e+00, -1.29213076e+00, -9.29715823e-01, -5.90820412e-01,
       -3.49771481e-01,  1.37624505e+00,  4.50713572e-01, -6.22773608e-02,
        5.57771976e-01, -1.02147545e-01,  7.51326437e-01,  1.53099523e-01,
       -3.56955058e-02, -1.09505644e-02,  6.06311439e-01, -5.20949543e-01,
        1.12653966e+00,  1.04471114e+00, -1.89705695e+00,  4.33318978e-01,
       -1.95552801e-01, -3.15067362e-01, -3.37964801e+00, -3.20413002e-01,
        7.18864220e-01,  1.14909963e+00,  2.98742283e+00, -5.13353726e-01,
       -6.15425288e-01,  2.41580016e-01,  1.02192540e+00,  1.59715591e+00,
       -1.23598386e-01,  1.13400289e-01, -1.36019336e+00, -1.78658337e+00,
        2.86802585e-01, -6.82871479e-01, -1.47120462e+00,  4.39614142e-02,
       -6.70656962e-01,  1.37732344e+00, -6.56176021e-01, -4.42790745e-01,
        5.28168990e-01,  2.16393147e-01,  1.32586706e+00, -2.05836007e-01,
        2.32724543e+00,  3.37643526e-01,  5.69883150e-02, -7.02618892e-01,
        7.85141319e-01, -2.40073428e-01, -6.81715867e-01, -2.35500451e+00,
        1.02808307e-01, -3.63872235e-01, -7.29331422e-01, -2.26390085e+00,
       -8.44285462e-01, -7.90654310e-01, -1.56201508e+00,  8.52633765e-01,
       -1.72898714e+00,  4.71949851e-01,  2.00729243e+00, -7.80272328e-02,
        8.41687634e-01,  1.29705589e+00, -9.94177146e-01, -4.41906640e-01,
       -3.13626317e-01, -8.87590244e-01,  6.85618924e-02,  1.37956450e+00,
        9.93304673e-03, -4.40254408e-01, -5.34283991e-01, -4.18094966e-01,
       -2.95558943e-01,  4.64349126e-01,  4.05728934e-01, -8.86136803e-01,
       -9.47860768e-01,  3.57619186e-01,  4.53166907e-01,  1.37613618e+00,
        3.66884808e-01, -8.49744566e-01,  1.65615245e+00,  1.09063243e+00,
        9.45142161e-01,  1.08602261e+00, -2.85403860e+00,  8.36056244e-01,
        1.80058276e-01, -3.42710402e-01,  1.17483247e+00, -2.54882825e-01,
       -2.60588772e-01, -3.01091386e-01, -1.55139939e-01, -8.19168963e-02,
       -5.71519197e-01,  1.13921101e+00, -1.08563908e+00,  1.80970380e+00,
       -1.09575944e+00, -1.32308785e+00,  7.02089953e-01, -1.25520444e+00,
       -8.30608802e-01,  6.13431161e-01,  8.05187090e-01,  1.03318154e+00,
       -4.69431131e-01,  1.85420154e+00,  1.43524565e+00,  2.09765594e-01,
       -7.27031529e-01, -1.50252412e-02, -8.60721119e-01, -6.91888431e-01,
       -3.52146510e-01,  4.26453693e-01, -4.34043277e-01, -1.55954469e+00,
       -1.10429136e+00, -6.84267612e-01,  1.02579283e+00, -6.17446657e-01,
       -9.54363131e-01, -8.58851292e-01,  7.25008541e-01,  6.15656632e-01,
        9.66953767e-01,  2.16474364e-01, -3.13395059e-02, -1.03091150e+00,
       -8.22925717e-01, -1.07771182e-01,  5.08867052e-01, -1.26158559e+00,
       -3.97111341e-01,  2.77140941e-01, -9.47642028e-01, -3.77994238e-01,
       -4.75243136e-01, -6.62184237e-01,  1.22117591e+00, -8.56974015e-01,
        2.89382331e-02, -1.83982727e+00,  1.74045027e+00,  2.34622826e-01,
       -1.66989654e-01, -3.20122223e-01,  1.29899336e-01,  3.74499752e-01,
        1.29080284e+00,  1.77231811e-02,  2.32352283e-01, -4.04258649e-02,
        6.22277730e-01,  8.82393359e-01, -1.91222992e+00,  1.45184683e+00,
        5.07654618e-01, -8.44116849e-01,  7.43237646e-01, -2.20880414e-01,
       -9.70079142e-01, -1.52784606e+00, -5.81590998e-01, -8.07562329e-01,
        8.22273191e-01, -7.73106347e-01, -1.71726047e-01, -6.74486684e-01,
       -5.10371701e-01,  5.11044812e-01,  9.14523704e-01,  6.51329327e-01,
       -1.26550209e+00, -1.17988978e+00, -8.39318889e-01, -2.28635462e-01,
       -1.72868353e-01,  1.19817349e+00,  7.82825121e-01,  8.23575760e-01,
        1.24894293e+00,  2.23077395e+00,  8.03216147e-01,  1.45390240e+00,
       -1.79090782e+00,  7.61364064e-01,  6.63907055e-01, -1.10970885e+00,
        9.61539377e-02, -7.39883775e-01, -1.07677414e-01, -7.49939562e-01,
        9.23376056e-02, -4.41036998e-01, -1.23623693e+00, -4.02844472e-01,
       -7.63110958e-01, -5.77966785e-02,  6.39150122e-01, -1.47848389e-01,
        9.59751722e-02,  2.03780015e+00,  1.17959954e+00, -9.92260434e-01,
        8.56351891e-01, -1.44833637e+00, -5.53848497e-01,  5.58892746e-01,
        2.64511882e-01, -7.73192633e-01,  1.44411510e+00, -3.65430451e-01,
        2.02521780e+00,  7.70297302e-01, -6.09236603e-01,  1.86348307e+00,
        8.30531981e-01,  6.57875532e-01, -1.55569681e+00,  3.92613013e-01,
        1.81619613e-01, -2.38612793e-01,  5.17203034e-01, -7.02507587e-01,
        3.38783907e-01, -5.47425723e-01, -1.23775404e+00,  1.63608332e+00,
       -3.76894491e-01, -1.77939686e+00,  4.90545031e-01, -1.01788277e-01,
       -1.99781294e-01, -2.85377338e-01, -1.13492985e+00, -1.20226048e+00,
        1.02386548e+00,  2.33509997e-01,  1.40949930e-01,  2.24748423e+00,
       -3.17527068e-01, -1.95845015e+00,  2.20833182e-01, -1.47820336e+00,
       -9.60416294e-01,  7.43786854e-01,  1.93565127e-01, -2.43942252e+00,
       -1.03734102e-01,  8.92903799e-01,  1.53735742e+00, -5.22442781e-01,
       -5.01371674e-01,  8.33693837e-01, -1.75729991e+00,  9.59151941e-02,
        3.78988676e-01, -7.49325494e-01,  8.42446842e-01, -9.04097559e-01,
       -1.06359150e+00,  5.15181870e-04,  3.77585418e-01, -7.05554186e-01,
        5.92025932e-01,  2.77259997e-01, -6.19384223e-01, -2.51304315e-01,
       -1.38656159e+00, -3.64914217e-01, -4.46313422e-01,  1.21648719e-01,
       -4.31774873e-01,  1.47747991e-01,  2.30429579e-01, -1.73818891e+00,
       -1.00165055e+00, -1.57265105e+00, -7.21486334e-01,  1.71199145e-01,
       -1.79690796e-01,  1.85363282e+00,  1.35241118e+00, -1.74596750e+00,
       -4.05383371e-01, -6.13377023e-01, -3.40504026e-01, -6.41881086e-01,
       -2.96816435e-01,  1.53580381e-01,  3.22591994e-02, -1.32167211e+00,
        2.00454206e+00, -1.87594434e+00, -2.38057026e-01, -1.01618292e+00,
        8.37276641e-01, -2.03215213e-01, -6.55032200e-02, -1.42997604e+00,
        1.34934767e+00, -8.80262364e-01, -7.87808077e-02,  2.08555276e-01,
       -9.68463044e-01,  1.37623904e-01, -9.27297790e-01,  1.51359051e+00,
        5.94393875e-02, -1.06619715e+00, -1.52373407e+00, -6.96935884e-01,
       -6.16363844e-01, -1.57129709e+00,  5.65828466e-01, -8.19141685e-01,
        6.75524475e-01,  1.14019401e+00, -6.50798002e-01,  7.39078735e-01,
        1.35415219e+00,  3.57510552e-01, -4.35067386e-01,  1.05054452e-01,
        8.97665410e-01, -1.51279879e-01,  4.70759203e-01,  5.41245501e-01,
       -5.20097446e-01, -5.24481138e-01,  2.15797688e-01, -8.64687908e-01,
       -8.86416997e-01, -2.89987919e-01, -5.80269317e-01, -6.86578241e-01,
       -1.40267819e-01,  2.25000103e-01,  3.26361618e-01,  5.57521369e-01,
       -3.93081456e-03, -1.89649676e-01,  3.99320635e-01, -1.97146696e-01,
       -4.20512766e-01,  6.44909432e-01, -7.76604526e-01, -1.57946773e+00,
        1.83890101e-01,  1.90996643e+00, -1.30233114e+00,  8.62272201e-01,
       -1.02466720e+00, -1.53623049e-01, -2.52811796e-01,  9.11385415e-01,
        8.64836721e-03,  9.03621288e-01,  1.29979231e+00,  3.08855952e-02,
       -9.78106713e-01, -2.21974394e+00,  9.73961433e-01, -1.32780283e+00,
       -1.07173250e+00, -6.65714848e-01, -1.42673143e-01, -8.38836473e-01,
        1.51718696e+00, -1.09456763e+00,  1.16332253e+00, -1.58279264e+00,
        4.37520830e-02, -1.18003936e+00,  1.15662129e+00,  1.55091644e+00,
       -4.27516673e-01,  1.01153997e+00, -1.41457303e+00, -1.87607697e+00,
       -4.36111328e-01, -9.49575664e-02,  8.70433600e-01, -2.94985940e-01,
        1.17043551e+00,  3.81268627e-01,  2.42708121e+00,  1.25200846e+00,
        6.63147248e-01, -2.21040440e+00,  3.31701423e-01, -6.16100431e-01,
        7.92635473e-01,  1.75158489e-01,  1.08687829e+00, -2.22071760e-01,
        6.22028946e-01, -8.58897052e-01,  6.35361325e-01,  1.10415406e-04,
        2.20574828e+00, -6.37954143e-01,  6.57411015e-01, -2.30059889e-02,
       -1.30069819e+00,  6.12831075e-01,  9.39721337e-01, -3.16426669e-01,
       -1.06774260e+00,  2.35983438e+00,  1.54059102e-01,  5.03736065e-01,
        1.54119905e-01,  7.26193201e-01,  6.50382305e-01, -4.62948075e-01,
        9.00692594e-02, -9.34370324e-01, -1.43258585e+00, -4.24821428e-01,
       -1.59867681e-01, -1.07403842e+00,  4.85055714e-01, -3.28738804e-02,
        1.88473805e-01, -1.09378040e-01,  8.18413661e-01, -1.53945804e+00,
        1.20723212e+00,  1.68898859e+00,  1.02991948e-01, -6.13673874e-01,
       -3.14252897e-01, -6.11905518e-01,  1.07294420e+00, -6.41081792e-01,
        1.99382487e+00, -4.75009614e-01,  5.35101906e-01, -1.50289750e+00,
       -1.43375272e-01,  8.15466124e-01, -2.50102650e-01,  5.61376385e-01,
       -1.58508089e+00, -3.45132286e+00, -1.16150546e+00, -1.38262371e+00,
       -9.68420757e-01,  1.14044815e+00,  1.61834591e+00, -1.67060485e+00,
       -5.29473988e-02, -5.79357250e-01,  9.44544582e-01, -1.54098781e-01,
       -7.08648975e-01,  4.46434241e-01,  1.45105837e+00, -2.77955226e-01,
        5.43957547e-01,  3.63430725e-01,  5.98114611e-01,  6.23627527e-01,
       -1.37379150e+00, -1.17810624e+00,  1.65304479e-01,  5.60709513e-01,
        1.93645531e-01,  1.14569158e+00,  3.38978930e-01,  1.69541260e-01,
        5.42186875e-01, -3.14024175e-01,  1.71015063e+00,  1.12202905e+00,
        8.37917575e-01, -4.58696138e-02,  8.04416967e-01, -1.37744676e+00,
       -8.49268169e-02, -1.09544996e-01,  3.59791550e-01,  4.13896991e-01,
        5.68498097e-01,  5.47968083e-01, -3.96503178e-01,  3.79994175e-01,
        2.23747457e-01, -6.86725729e-01,  1.02822121e+00,  1.70643874e-02,
        5.79057866e-01, -1.58007742e-01,  3.99668634e-01,  1.07464915e+00,
       -1.40657292e-01, -9.67890333e-01, -1.69381032e+00, -5.09409443e-01,
        1.80670525e-01,  7.77050107e-01, -5.20748336e-01, -1.21694807e+00,
       -9.25257950e-01, -1.03691594e-01, -8.69305007e-01,  7.35212313e-01,
        2.36150039e-01,  2.87161376e-01, -2.20731559e-01, -9.35763559e-01,
       -2.44763911e-01, -1.44817486e+00, -1.97029131e-01, -8.37990204e-01,
        2.93638205e-01,  6.29720488e-01,  7.43440737e-01, -5.85854784e-01,
        8.75472482e-03, -6.14080549e-01,  1.60477775e+00, -3.60611673e-01,
       -4.48739309e-01, -1.49289409e-01, -1.80966991e-01,  1.83215510e+00,
        1.81120677e-01,  4.28274277e-01,  1.48276653e+00,  7.62492369e-01,
       -1.99662403e+00,  1.44581300e+00,  1.74686360e+00,  8.06535487e-01,
       -5.31406314e-01,  1.41883139e+00, -9.93327005e-01, -1.41231452e+00,
       -8.96570732e-01,  1.93428538e+00, -1.51445595e+00, -6.61465664e-01,
        4.36165795e-01,  5.84683676e-01, -4.61089122e-02,  1.60527265e-02,
        1.04281810e+00,  3.93700566e-01, -4.33015378e-01, -7.92365789e-01,
       -6.58802887e-01,  1.18288763e+00, -3.75734106e-01,  1.54856597e+00,
       -1.14410635e-01,  9.78421084e-01,  1.83567509e+00,  4.93738378e-02,
        3.13148991e-01,  5.79908597e-01, -3.84626963e-01, -9.61221267e-01,
        3.05782738e-01, -2.14530000e-01, -9.99117506e-01, -4.90225581e-01,
        4.24879906e-01,  1.26783048e-01,  1.16987776e-01,  5.91908190e-01,
       -7.89902268e-01, -5.30034284e-01,  1.66687603e-01, -1.34973069e+00,
       -8.16744341e-01, -2.66418365e-01,  8.56623998e-01, -9.83926175e-01,
        1.69639602e+00, -1.01054444e+00, -4.62811247e-01,  7.21007696e-01,
       -6.26710255e-01, -1.74562376e+00, -1.60367145e-01, -4.67369393e-01,
       -1.56607043e-01,  4.06784769e-01,  4.27827386e-01, -5.33387357e-01,
        2.10390016e+00, -9.90883083e-02, -9.27301180e-01,  1.61436572e+00,
       -1.61852758e-02,  7.79928073e-01,  1.46975375e+00, -2.32018987e+00,
       -1.00884945e+00, -1.18496733e-01, -8.86554676e-01,  2.53200472e+00,
        8.80774832e-01,  2.88333790e-01, -6.18895117e-01, -9.58647733e-01,
       -5.71381088e-01,  1.77096882e+00, -1.90180141e+00, -1.19509564e+00,
        2.43677158e-01,  9.79318320e-01,  3.10440777e-01, -3.64714711e-01,
       -2.32260387e-02, -2.26268087e-01, -5.68322125e-01, -2.72618235e-01,
        1.96203779e+00,  1.78777221e-01, -1.21080864e+00,  2.53672942e+00,
        2.56579196e+00,  1.03380006e+00, -2.35448861e-01,  9.52838847e-01,
        8.30179354e-01, -2.48787965e-01, -4.52859160e-01,  6.98383585e-01,
        2.90534840e-01, -1.33435170e+00, -1.40653517e+00,  1.65895539e+00,
        2.46252005e+00,  6.86707106e-01,  5.58079612e-01, -1.49366485e+00,
       -1.39227074e+00,  5.65037930e-02, -4.98767874e-01, -1.84656298e+00,
       -1.94335033e+00, -2.37449148e+00,  1.34881647e-03,  7.19197631e-01])

In [112]:
cats = pd.qcut(data, 4)

In [113]:
cats

[(-0.662, -0.0618], (-3.452, -0.662], (-0.662, -0.0618], (-3.452, -0.662], (0.593, 3.261], ..., (-3.452, -0.662], (-3.452, -0.662], (-3.452, -0.662], (-0.0618, 0.593], (0.593, 3.261]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.452, -0.662] < (-0.662, -0.0618] < (-0.0618, 0.593] < (0.593, 3.261]]

In [114]:
pd.value_counts(cats)

(-3.452, -0.662]     250
(-0.662, -0.0618]    250
(-0.0618, 0.593]     250
(0.593, 3.261]       250
dtype: int64

In [115]:
cats = pd.cut(data, 4, precision=2)

In [116]:
pd.value_counts(cats) # 不是均匀分布的个数

(-0.095, 1.58]     457
(-1.77, -0.095]    451
(1.58, 3.26]        56
(-3.46, -1.77]      36
dtype: int64

In [117]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.0])

In [118]:
cats

[(-1.262, -0.0618], (-1.262, -0.0618], (-1.262, -0.0618], (-1.262, -0.0618], (-0.0618, 1.209], ..., (-3.452, -1.262], (-3.452, -1.262], (-3.452, -1.262], (-0.0618, 1.209], (-0.0618, 1.209]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.452, -1.262] < (-1.262, -0.0618] < (-0.0618, 1.209] < (1.209, 3.261]]

In [119]:
pd.value_counts(cats|)

SyntaxError: invalid syntax (Temp/ipykernel_17736/916473283.py, line 1)